/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   check_color.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: lrosalee <lrosalee@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/10 21:27:33 by lrosalee          #+#    #+#             */
/*   Updated: 2020/02/10 21:31:58 by lrosalee         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../includes/fdf.h"

/*
** Проверяем наличие ',' в переданном значение и валидность параметров,
** в случае, если ',' была найдена. Возвращаем указатель на первый символ
** после запятой. И если больше 9 то тоже ошибка
*/

int 	ft_check_color(const char *str, int ptr, int i)
{
	int		count;

	count = 0;
	while (str[i] && str[i] != ',')
	{
		if (str[i] == '-' || str[i] == '+')
			i++;
		if (!(ft_isdigit(str[i])))
			return (-1);
		i++;
	}
	if (str[i] == ',')
	{
		ptr = i + 1;
		while (str[++i])
		{
			if ((str[i] > 102 && str[i] != 'x') || (str[i] < 48 && str[i] != 44)
				|| (str[i] < 65 && str[i] > 57) || (str[i] > 70 && str[i] < 97))
				return (-1);
			count++;
		}
	}
	if (count >= 9)
		return (-1);
	return (ptr);
}